#include "Mathematic_assistance_systems_for_young_children.h"

//主菜单
void run()
{
	int choice;
	
	printf("主界面>>\n");
	printf("+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*\n");
	printf("*                                                                                  +\n");
	printf("+                                                                                  *\n");	
	printf("*                             欢迎来到数学辅助学习系统                             +\n");
	printf("+                                                                                  *\n");
	printf("*                               ___________________                                +\n");
	printf("+                               |                 |                                *\n");
	printf("*                               |   1、加法训练   |                                +\n");
	printf("+                               |_________________|                                *\n");
	printf("*                                                                                  +\n");
	printf("+                               ____________________                               *\n");
	printf("*                               |                  |                               +\n");
	printf("+                               |   2、减法训练    |                               *\n");
	printf("*                               |__________________|                               +\n");
	printf("+                                                                                  *\n");
	printf("*                               ____________________                               +\n");
	printf("+                               |                  |                               *\n");
	printf("*                               |   3、乘法训练    |                               +\n");
	printf("+                               |__________________|                               *\n");
	printf("*                                                                                  +\n");	
	printf("+                               ____________________                               *\n");
	printf("*                               |                  |                               +\n");
	printf("+                               |   4、除法训练    |                               *\n");
	printf("*                               |__________________|                               +\n");
	printf("+                                                                                  *\n");
	printf("*                               ____________________                               +\n");
	printf("+                               |                  |                               *\n");
	printf("*                               |   5、综合训练    |                               +\n");
	printf("+                               |__________________|                               *\n");	
	printf("*                                                                                  +\n");	
	printf("+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*+*\n");
	printf("                                                                       按ESC退出系统\n");	
	printf("请输入您的需求：");


}